
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Перем ДопНастройки;
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ТЗНастроек = Параметры.СохраненныеНастройки.Выгрузить();
	СохраненныеНастройкиПользователей.Загрузить(ТЗНастроек);
	ИмяВнешнейОбработки = Параметры.ИмяВнешнейОбработки;
	КлючВарианта = Параметры.КлючВарианта;
	
	УсловноеОформлениеФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура СохраненныеНастройкиПользователейВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.СохраненныеНастройкиПользователей.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураОтвета = Новый Структура("Настройка, ПереформироватьСписок", ТекущиеДанные.Настройка, ПереформироватьСписокНастроек);
	Закрыть(СтруктураОтвета);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если НЕ ЗавершениеРаботы Тогда 
		СтруктураОтвета = Новый Структура("ПереформироватьСписок", ПереформироватьСписокНастроек);
		Закрыть(СтруктураОтвета);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

/////////////////////////////////////////////////////////////////////////////////////////// 

#Область КомандыФормы

&НаКлиенте
Процедура ДобавитьНастройку(Команда)
		
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("НастройкиОтчета",	Параметры.НастройкиОтчета);
	ПараметрыФормы.Вставить("КлючВарианта",		КлючВарианта);
	ПараметрыФормы.Вставить("ИмяОтчета",		ИмяВнешнейОбработки);
	
	Режим = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;	
	ОповещениеСохранениеНастроек = Новый ОписаниеОповещения("ОбработкаСохранениеНастроек", ЭтотОбъект);
	ОткрытьФорму("ВнешнийОтчет." + ИмяВнешнейОбработки + ".Форма.ФормаСохраненияНастройкиУпр",ПараметрыФормы, ЭтотОбъект, Новый УникальныйИдентификатор,,, ОповещениеСохранениеНастроек, Режим);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаСохранениеНастроек(РезультатВыбора, ДопПараметры) Экспорт
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если РезультатВыбора.ПереформироватьСписок Тогда
		СформироватьСписокОтчетовПользователя();
	КонецЕсли; 
	//НастройкиОтчета.СохраненныйВариант = РезультатВыбора;
	//ЭтаФорма.Заголовок = РезультатВыбора.Наименование;
	//
	//СохранитьНастройкуСервер(РезультатВыбора);
		
КонецПроцедуры // ОбработкаЗакрытияНастроекФормы()

&НаСервере
Процедура СформироватьСписокОтчетовПользователя()
	
	РеквизитФормыВЗначение("Отчет").СформироватьСписокСохраненныхНастроекПользователя(Параметры.НастройкиОтчета, СохраненныеНастройкиПользователей);
	
КонецПроцедуры	// СохранитьНастройуСервер

//------------------------------------------

&НаСервереБезКонтекста
Процедура УстановитьБыстрыйВыборНаСервере(Настройка, БыстрыйВыбор)
	НастройкаОбъект = Настройка.ПолучитьОбъект();
	НастройкаОбъект.Пользовательский = БыстрыйВыбор;
	НастройкаОбъект.Записать();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьБыстрыйВыбор(Команда)
	ТекущиеДанные = Элементы.СохраненныеНастройкиПользователей.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекущиеДанные.БыстрыйВыбор = НЕ ТекущиеДанные.БыстрыйВыбор;
	УстановитьБыстрыйВыборНаСервере(ТекущиеДанные.Настройка, ТекущиеДанные.БыстрыйВыбор);
КонецПроцедуры

//------------------------------------------

&НаКлиенте
Процедура ИзменитьНастройку(Команда)
	ТекущиеДанные = Элементы.СохраненныеНастройкиПользователей.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТекущийВариант",	ТекущиеДанные.Настройка);
	ПараметрыФормы.Вставить("НастройкиОтчета",	Параметры.НастройкиОтчета);
	ПараметрыФормы.Вставить("КлючВарианта",		КлючВарианта);
	ПараметрыФормы.Вставить("ИмяОтчета",		ИмяВнешнейОбработки);
	
	Режим = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;	
	ОповещениеСохранениеНастроек = Новый ОписаниеОповещения("ОбработкаИзмененияНастроек", ЭтотОбъект);
	ОткрытьФорму("ВнешнийОтчет." + ИмяВнешнейОбработки + ".Форма.ФормаСохраненияНастройкиУпр",ПараметрыФормы, ЭтотОбъект, Новый УникальныйИдентификатор,,, ОповещениеСохранениеНастроек, Режим);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаИзмененияНастроек(РезультатВыбора, ДопПараметры) Экспорт
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	//НастройкиОтчета.СохраненныйВариант = РезультатВыбора;
	//ЭтаФорма.Заголовок = РезультатВыбора.Наименование;
	//
	//СохранитьНастройкуСервер(РезультатВыбора);
		
КонецПроцедуры // ОбработкаИзмененияНастроек()

&НаСервере
Процедура ИзменитьНастройкуСервер(ВыбраннаяНастройка)
	//РеквизитФормыВЗначение("Отчет").СформироватьСписокСохраненныхНастроекПользователя(НастройкиОтчета);
	//СформироватьБыстрыйДоступКНастройкамПользователя();
	//
	//Если ВыбраннаяНастройка.Пользовательский Тогда
	//	// устанавливаем пометку, что используется именно эта настройка уже
	//	УстановитьПометкуИспользованияНастройки(ВыбраннаяНастройка);
	//КонецЕсли; 
	
КонецПроцедуры	// ИзменитьНастройкуСервер

//------------------------------------------

&НаСервереБезКонтекста
Процедура УдалитьНастройкуНаСервере(Настройка)
	НастройкаОбъект = Настройка.ПолучитьОбъект();
	НастройкаОбъект.ОбменДанными.Загрузка = Истина;
	НастройкаОбъект.ПредопределенныйВариант = Ложь;
	НастройкаОбъект.ПометкаУдаления = Истина;
	НастройкаОбъект.Записать();
КонецПроцедуры

&НаКлиенте
Процедура УдалитьНастройку(Команда)
	ТекущиеДанные = Элементы.СохраненныеНастройкиПользователей.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УдалитьНастройкуНаСервере(ТекущиеДанные.Настройка);
	ПереформироватьСписокНастроек = Истина;
	
	СохраненныеНастройкиПользователей.Удалить(СохраненныеНастройкиПользователей.Индекс(ТекущиеДанные));
	
КонецПроцедуры

//------------------------------------------

&НаКлиенте
Процедура ОбработкаКопированияНастроек(РезультатВыбора, ДопПараметры) Экспорт
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	//НастройкиОтчета.СохраненныйВариант = РезультатВыбора;
	//ЭтаФорма.Заголовок = РезультатВыбора.Наименование;
	//
	//СохранитьНастройкуСервер(РезультатВыбора);
		
КонецПроцедуры // ОбработкаЗакрытияНастроекФормы()

&НаКлиенте
Процедура СкопироватьНастройкуПользователям(Команда)
	ТекущиеДанные = Элементы.СохраненныеНастройкиПользователей.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Настройка",	ТекущиеДанные.Настройка);
	
	Режим = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;	
	ОповещениеСохранениеНастроек = Новый ОписаниеОповещения("ОбработкаКопированияНастроек", ЭтотОбъект);
	ОткрытьФорму("ВнешнийОтчет." + Параметры.НастройкиОтчета.ИмяВнешнейОбработки + ".Форма.ФормаКопированияНастроекУп",ПараметрыФормы, ЭтотОбъект, Новый УникальныйИдентификатор,,, ОповещениеСохранениеНастроек, Режим);
	
КонецПроцедуры

//------------------------------------------

&НаКлиенте
Процедура ВыбратьНастройку(Команда)
	ТекущиеДанные = Элементы.СохраненныеНастройкиПользователей.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураОтвета = Новый Структура("Настройка, ПереформироватьСписок", ТекущиеДанные.Настройка, ПереформироватьСписокНастроек);
	Закрыть(СтруктураОтвета);
	
КонецПроцедуры

// ---------------------------------------------

&НаСервереБезКонтекста
Процедура ВыгрузитьНастройкуНаСервере(ПутьКФайлу, ВыбраннаяНастройка)
	НастройкаПользователя = ВыбраннаяНастройка.Настройки.Получить();
	НовыйСXDTO = Новый СериализаторXDTO(ФабрикаXDTO);

	Запись = Новый ЗаписьXML;	
	Запись.ОткрытьФайл(ПутьКФайлу);
	Запись.ЗаписатьОбъявлениеXML();
	
	НовыйСXDTO.ЗаписатьXML(Запись, НастройкаПользователя, НазначениеТипаXML.Явное, ФормаXML.Элемент);
	Запись.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьНастройку(Команда)
	ТекущиеДанные = Элементы.СохраненныеНастройкиПользователей.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбработатьНачалоВыбораФайла(Истина, ТекущиеДанные.Наименование);
	Если ЗначениеЗаполнено(ПутьКФайлу) Тогда
		ВыгрузитьНастройкуНаСервере(ПутьКФайлу, ТекущиеДанные.Настройка);		
	КонецЕсли; 
КонецПроцедуры

#КонецОбласти 

#Область Вспомогательные

&НаСервере 
Процедура УсловноеОформлениеФормы()
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	 
	// Зададим отбор (условия при которых будет выполнено оформление)
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение     = Новый ПолеКомпоновкиДанных("СохраненныеНастройкиПользователей.Настройка");
	ЭлементОтбора.ВидСравнения      = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение    = Параметры.НастройкиОтчета.СохраненныйВариант;
	ЭлементОтбора.Использование     = Истина;
	 
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.БледноМиндальный);	 
	ЭлементОформления.Использование = Истина;	
	
КонецПроцедуры	// УсловноеОформлениеФормы

&НаКлиенте
Процедура ОбработатьНачалоВыбораФайла(РежимВыгрузки = Истина, ИмяФайла = Неопределено)
	
	Если Не ПодключитьРасширениеРаботыСФайлами() Тогда
		ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения("ЗавершениеУстановкиРасширения", ЭтаФорма);		
		НачатьУстановкуРасширенияРаботыСФайлами(ОписаниеОповещенияОЗавершении);
	КонецЕсли;
	
	РежимДиалога = ?(РежимВыгрузки, РежимДиалогаВыбораФайла.Сохранение, РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалога);
	ДиалогВыбораФайла.ПроверятьСуществованиеФайла = Не РежимВыгрузки;
	ДиалогВыбораФайла.ПредварительныйПросмотр     = Ложь;	
	ДиалогВыбораФайла.МножественныйВыбор = Ложь;
	ДиалогВыбораФайла.Каталог = ПутьКФайлу;
	ДиалогВыбораФайла.Заголовок = Нстр("ru = 'Выберите файл для " + ?(РежимВыгрузки, "загрузки'", "выгрузки'"));
	ДиалогВыбораФайла.ПолноеИмяФайла = ?(ЗначениеЗаполнено(ИмяФайла) И РежимВыгрузки, СокрЛП(ИмяФайла) + ".xml", ПутьКФайлу);
	
	ДиалогВыбораФайла.Фильтр = "Формат выгрузки(*.xml)|*.xml|Все файлы (*.*)|*.*";
	ПутьКФайлу = "";
	
	Если ДиалогВыбораФайла.Выбрать() Тогда
		ПутьКФайлу = ДиалогВыбораФайла.ПолноеИмяФайла;
	КонецЕсли;
	
КонецПроцедуры	

#КонецОбласти  
