

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Перем ДопНастройки;
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Параметры.Настройка) Тогда
		Возврат;
	КонецЕсли; 
	
	// заполняем список пользователей с такими же настройками
	Запрос = Новый Запрос;
	//Запрос.Текст =
	
	
	//УсловноеОформлениеФормы();
	
КонецПроцедуры


&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если НЕ ЗавершениеРаботы Тогда 
		СтруктураОтвета = Новый Структура("ПереформироватьСписок", ПереформироватьСписокНастроек);
		Закрыть(СтруктураОтвета);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

/////////////////////////////////////////////////////////////////////////////////////////// 


&НаСервере
Функция СохранитьНастройкиСервер()
	//Если ЗначениеЗаполнено(Параметры.ТекущийВариант) Тогда
	//	ВариантОбъект = Параметры.ТекущийВариант.ПолучитьОбъект();
	//Иначе
	//	ВариантОбъект = Справочники.ВариантыОтчетов.СоздатьЭлемент();
	//	ВариантОбъект.ТипОтчета = ПредопределенноеЗначение("Перечисление.ТипыОтчетов.Дополнительный");
	//КонецЕсли;
	//
	//ВариантОбъект.Наименование 			= Наименование;
	//ВариантОбъект.Отчет					= ИмяОтчета;
	//ВариантОбъект.Родитель				= ГлУзелОтчетов;
	//ВариантОбъект.КлючВарианта			= КлючВарианта;
	//ВариантОбъект.Автор 				= Автор;
	//ВариантОбъект.Пользовательский 		= БыстрыйДоступ;   // быстрый доступ
	//ВариантОбъект.ВидимостьПоУмолчанию 	= Ложь;
	//ВариантОбъект.Описание 				= Описание;
	//ВариантОбъект.ТолькоДляАвтора 		= ТолькоДляАвтора;
	//
	//Настройки = ПолучитьИзВременногоХранилища(Параметры.АдресНастройки);	
	//ВариантОбъект.Настройки = Новый ХранилищеЗначения(Настройки, Новый СжатиеДанных(9));
	//ВариантОбъект.Записать();
	//
	//Возврат ВариантОбъект.Ссылка;
	
КонецФункции // СохранитьНастройкиСервер()
